judapies/Mufla/2020/Mufla 14L Psoc Avantika #004588425 OP2020341/Firmware Psoc V2.1.0- AjustePendientes/LCD2/MuflaGLCD.cydsn/Generated_Source/PSoC5/LCD128x64_1_LCD_DATA.h
/*******************************************************************************
* File Name: LCD128x64_1_LCD_DATA.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_LCD128x64_1_LCD_DATA_H) /* CY_CONTROL_REG_LCD128x64_1_LCD_DATA_H */
#define CY_CONTROL_REG_LCD128x64_1_LCD_DATA_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} LCD128x64_1_LCD_DATA_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    LCD128x64_1_LCD_DATA_Write(uint8 control) ;
uint8   LCD128x64_1_LCD_DATA_Read(void) ;

void LCD128x64_1_LCD_DATA_SaveConfig(void) ;
void LCD128x64_1_LCD_DATA_RestoreConfig(void) ;
void LCD128x64_1_LCD_DATA_Sleep(void) ; 
void LCD128x64_1_LCD_DATA_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define LCD128x64_1_LCD_DATA_Control        (* (reg8 *) LCD128x64_1_LCD_DATA_Sync_ctrl_reg__CONTROL_REG )
#define LCD128x64_1_LCD_DATA_Control_PTR    (  (reg8 *) LCD128x64_1_LCD_DATA_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_LCD128x64_1_LCD_DATA_H */


/* [] END OF FILE */
